artifacts/day4/read-warm-validation-local/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/competition.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 6s max duration (incl. graceful stop):
              * read_products: 2 looping VUs for 1s (exec: readProducts, gracefulStop: 5s)


running (1.0s), 2/2 VUs, 1462 complete and 0 interrupted iterations
read_products   [ 100% ] 2 VUs  1.0s/1s

     ✓ products returns 200
     ✓ products response follows contract

   ✓ checks.........................: 100.00% 2938 out of 2938
     data_received..................: 2.5 MB  2.4 MB/s
     data_sent......................: 156 kB  156 kB/s
     http_req_blocked...............: avg=1.92µs  min=476ns    med=1.44µs   p(90)=2.17µs   p(95)=2.55µs   p(99)=5.24µs  max=177.9µs 
     http_req_connecting............: avg=98ns    min=0s       med=0s       p(90)=0s       p(95)=0s       p(99)=0s      max=73µs    
     http_req_duration..............: avg=1.28ms  min=244.35µs med=473.9µs  p(90)=672.48µs p(95)=827.95µs p(99)=49.56ms max=94.14ms 
       { expected_response:true }...: avg=1.28ms  min=244.35µs med=473.9µs  p(90)=672.48µs p(95)=827.95µs p(99)=49.56ms max=94.14ms 
     http_req_failed................: 0.00%   0 out of 1469
     http_req_receiving.............: avg=20.43µs min=4.75µs   med=18.76µs  p(90)=30.49µs  p(95)=39.83µs  p(99)=60.78µs max=127.59µs
     http_req_sending...............: avg=4.98µs  min=1.5µs    med=4.42µs   p(90)=6.36µs   p(95)=7.67µs   p(99)=16.63µs max=155.77µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       p(90)=0s       p(95)=0s       p(99)=0s      max=0s      
     http_req_waiting...............: avg=1.25ms  min=226.6µs  med=450.3µs  p(90)=642.03µs p(95)=791.96µs p(99)=49.51ms max=94.11ms 
     http_reqs......................: 1469    1467.434233/s
     iteration_duration.............: avg=1.35ms  min=284.83µs med=544.07µs p(90)=764.64µs p(95)=933.72µs p(99)=49.66ms max=94.26ms 
     iterations.....................: 1469    1467.434233/s
     read_duration..................: avg=1.28ms  min=244.35µs med=473.9µs  p(90)=672.48µs p(95)=827.95µs p(99)=49.56ms max=94.14ms 
   ✓ read_infra_error...............: 0.00%   0 out of 1469
     read_requests..................: 1469    1467.434233/s
     vus............................: 2       min=2            max=2
     vus_max........................: 2       min=2            max=2


running (1.0s), 0/2 VUs, 1469 complete and 0 interrupted iterations
read_products ✓ [ 100% ] 2 VUs  1s